app/controllers/sessions_controller.rb

  def new
    if User.find_by(id: session[:user_id]) != nil
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1